Autodesk.Revit.UI.DoubleClickAction
Since:
2016
Possible actions Revit can take in response to the user double-clicking on an element.
Since:
2016

Autodesk.Revit.UI.DoubleClickAction.DeactivateView
Double-click should deactivate the active view.

Autodesk.Revit.UI.DoubleClickAction.EnterEditMode
Double-click will enter a specific edit mode for the element.

Autodesk.Revit.UI.DoubleClickAction.ActivateView
Double-click should activate the view or schedule.

Autodesk.Revit.UI.DoubleClickAction.EditType
Double-click should take the user to the edit type dialog.

Autodesk.Revit.UI.DoubleClickAction.EditFamily
Double-click should open the family for editing.

Autodesk.Revit.UI.DoubleClickAction.NoAction
Double-clicks should be ignored.